[
    "This is the start of a project to collate an enormous list of all sorts of random tasks!\nYou can use this list however you like- perhaps to assign yourself or your sub tasks, or inspire your next lock.\n\nEveryone is encouraged to add their own ideas as they wish, subject to these rules:\nNumber each of your tasks, following on from the last task posted.Tasks can’t reference specific people by name. You can identify people by role, such as ‘your keyholder’, ‘another sub’, and so on.More specific, interesting, memorable tasks are better. Weirder is better. There will be a LOT of tasks over time! (For example, ‘10 minutes cornertime’ is a bit dull, but how about ‘cornertime until you flawlessly recite ‘baa baa black sheep’ backwards’?)Don’t worry about making a task that everyone can do. Some people don’t have specific toys, or even a keyholder- that’s fine, they can do another task. Everyone has very different limits, so a task that isn't a limit for someone is likely a very boring task!Try to avoid multi-stage tasks by breaking them into multiple entries instead. E.g., instead of ‘flip a coin, on heads X, on tails Y’, add X and Y to the list separately.Skim the list first, to make sure your idea (or something similar) isn't on it already.I’m not yucking anyone’s yums, but I want this list to be as easily usable as possible by people who are struggling to find tasks here. As such, please don’t include any of the following kinks:RL kink/sex hookupsScatReally extreme public humiliation (“life ruining” stuff)Anything that causes permanent damage\nOther than that, go wild! You can write up everything you’ve done in one big post, or just add random ideas one at a time as they come to mind.\n\nFinally, note that this isn’t an “official” list of “approved” tasks or anything, just another community resource. As always, play safe, and exercise your best judgement when anyone asks you to perform any task- not just ones from this list! (edited)",
    "Rolling a task using Dyno is hard, as you can't specify an arbitrary dice size. But you can roll d10s, in sequence, equal to the number of digits, to get a balanced random number. You can use a smaller dice for the first digit if there's fewer tasks (d2, d4, d6, d8) to save time. You will need to subtract 1 from the result in this instance.\n\nFor example, presume there are 25 tasks, and I want to roll a random one.\nI start by rolling a d4, and get a 4. 4 minus 1 is 3, and there aren't any tasks from 30 to 39 yet, so I start again.\n\nI roll a d4 again. This time I get a 3. 3 minus 1 is 2. There are some tasks starting with 2, so I continue.\nI roll a d10, and get a 7. 2 & 7- task number 27! Unfortunately, there's no such task. I start again.\n\nI roll a d4. I get a 1. 1 minus 1 is 0, so my task will be from 00 (another reroll) to 09.\nI roll a d10, and get a 1. That's 0 & 1- task number 1. Time to drink some water!\n\n\nAnyway, here’s a few tasks to get us started!\n\n1) Drink a glass of water.\n2) Balance a book on your head for 10 minutes. If it falls off, start again.\n3) Go outside and collect a bag of litter.\n4) Play a round/level/game of the last video game you played. If you lose, do another task.\n5) Do 2 more random tasks from this list.\n6) Write at least 1 paragraph to your keyholder, thanking them for all their time and attention. (edited)",
    "7) Watch or read an earlier version of a film or story you've already seen. For example, if you like 'Indiana Jones and the Crystal Skull', you could go and watch 'Raiders of the Lost Ark'.",
    "8) Listen to the song \"baby shark' on repeat for 30 minutes",
    "9)  Use light mode on all apps that support it until you go to bed. (edited)",
    "10) Think about 5 things you love about yourself\n11) Send a genuine compliment to at least 5 different person (can be on discord, to family, friend, who you want)",
    "12) Hop on voice chat and talk to whoever joins for at least an hour.\n13) Hop on a community gaming server (eg Minecraft or Terraria) and play for at least an hour.\n14) Ask in general chat for a random picture. Draw that picture on your body as best you can, then post the two pictures side-by-side in task-verification.",
    "15)  Add another task to this list.",
    "16) complete the following WriteForMe  (jigsaw+linetyping) https: //writeforme.org/task/63c1cba878d0a8c16e752fe8",
    "17) Slap your balls with a banana 50 times (other fruits/veg could be acceptable.)\n18)Cum (ruined) into the dish you’re going to use for your next meal and spread that cum around so it coats the dish.\n19) Shove an ice cube up your butt then plug yourself. Wait until it melts and then take the plug out.\n20) Buy a piece of ginger a few inches in length.  Peel the outside and cut an indented notch in the base (so it won't get lost).  Then, use it as a butt plug.  Keep it in for (10/15/20) minutes.\n21) Make yourself a nice meal, like a Sunday roast.\nBefore eating it, put it in a blender.",
    "22) Eat some chilli/(something spicy). Fuck your mouth for 5 minutes with a dildo then ride the same dildo for 5 minutes.\n23) Clean your kitchen's floor on your hands and knees. (Bonus points for doing it naked!)",
    "24) Pick a dish that involves lots of raw ingredients. Make the dish, burning or entirely undercooking each ingredient and eat it.",
    "I'll share my favourite task\n25) Every sentence that you write to your keyholder has to end in \"meow\" for 24h",
    "26) Clean your toilet. Really thoroughly, not just the bowl, but around the base and under the rim too.\n27) Choose one of the media channels. For 48h, whenever you notice a new post in there, you must change your wallpaper/background image to the most recently posted.\n28) Verify every picture on Chaster.",
    "29) add time to every pillory.",
    "30) Send a message to a non-kinky friend, containing the words \"please\", \"lock\", and \"me\" (in any order, with any other words added).\n31) Attend a ⁠⏰┃community-events.\n32) Buy a new smaller/spikier/more secure/more embarrassing cage or belt.",
    "33) Work-out / exercise for 30 minutes.",
    "34) complete this jigsaw https://www.jigsawplanet.com/?rc=play&pid=258ce5b2146a",
    "35) ask you keyholder for a handwriting assigment. at least 1000 words in total. (e.g write a 20 word sentence 50 times)",
    "36) create an original chastity themed caption and post it in ⁠📷┃caption-pics",
    "37) create an original chastity themed caption with an picture showing you and post it in ⁠📷┃caption-pics",
    "38) put on some nipple clamps to wear during the next task and roll again.",
    "39) make a nice picture/drawing for your keyholder. Subject of your choice, or ask keyholder if you can't think of anything.",
    "Cum is delicious. Treat yo self to one of these tasks:\n\n40) Coffee with extra cum for your morning pick me up\n41) Peanut butter and cum sandwich for your lunch box\n42) Ice cream topped with sprinkles and cum for being a good boy/girl/sissy",
    "43) Wear a small butt plug with a minty tooth paste as lubricant, for one hour.\n44) Do not use furniture when at home today. Stand or use the floor.\n45) Stand 15 minutes with a cup of water on your head, in your highest heels and with a vibrating plug. If it falls, start over. Try at least 3 times.",
    "46) Collared when at home, and leashed to a fixed point. Always ask your keyholder for permission to move the leash. \n47) Try on every gag that you have for 10 minutes each. Report every change to your keyholder.\n48) Go grocery shopping in a short skirt, thong, stockings, suspender belt, and stiletto heels.\n49) Take a warm bath, put on a comfy robe, and watch a nice movie.\n50) Watch any LOTR movie ballgagged and with your hands cuffed behind your back.\n51) Take a walk of at least 30 minutes plugged and collared.",
    "52) Refer to yourself only in 3rd person as ‘slave’ or whatever name your keyholder chooses. Beg to be punished for infractions.\n53) Ask the forum for advice on deep-throating a dildo.\n54) Ask your keyholder to choose a ‘Little For Big’ outfit for you to buy.\n55) Use clover nipple clamps attached to an ice lock to secure you in bondage for 20 minutes. Test first. Handcuffs and ring gag.\n56) Raise your maximum lock time limit by a day.\n57) 30 minutes of quietness with white noise in your earphones, an effective dark hood or blindfold, and a gag.\n58) Remain silent for 48h or until your keyholder speaks to you again. \n59) Beg your keyholder to rate your current outfit, whatever you are wearing when you get the task, and add or remove time accordingly.\n60) The floor is lava. Touch it only in high heels.\n61) Give a sex worker on Twitter a fulsome compliment for their beauty and class, and confess that you are in chastity. (Do not use DM. Do not send unwanted dick picks, locked or not.)\n62) Toss a coin. Tails, beg your keyholder to freeze your lock for a week. Heads, reward of their choice. (edited)",
    "63) do not touch you genitals in the next 24h, at all. (Shake your body if you want to lose the last peedrop, dry with a towel after a shower but pull it by the ends between your legs instead of rubbing there...)\n64) eat your next meal out of a dog bowl/plate on the ground without using your hands\n65) the next time you are free (or right now) edge 5 times, take a new task of this list afterwards",
    "66) No sleep for 24h.\n67) Put a small, not-sharp pebble in your shoe. Leave it there for 48h.\n68) If your lock has a share link, post it in ⁠🔗┃shared-links. If not, roll again.\n69) Nice! Lie down and get in this classic position as best you can by yourself. Then, do 69 strokes + deepthroats at the same time (even if caged).",
    "70) (naked or clothed) Empty a cup of yogurt over your head, add some chocolate sauce or honey and sprinkles for a sweet touch, sit in your shower or bathtub for 10 minutes before cleaning up and think about what a delicious snack you are.\n71) Buy a pair of panties and a bra in a shop IRL.\n72) Put on makeup and do a sexy photoshooting.\n73) Watch some rope bondage tutorials and try to recreate.",
    "@Dee! May I take a lazy approach and inject 200+ tasks ?\nhttps://cypress-plier-68f.notion.site/ba7b4688b42c44f3840f504dc2be2ca6?v=27e7a59a2c86498e9b1128e568202f80\n\n (edited)",
    "@Dee! May I take a lazy approach and inject 200+ tasks ? https://cypress-plier-68f.notion.site/ba7b4688b42c44f3840f504dc2be2ca6?v=27e7a59a2c86498e9b1128e568202f80   (edited)",
    "So long as they all meet the requirements, that would be fantastic! ",
    "274) Eat pancakes for every meal",
    "Cant guarantee that, i'd have to rewrite some i think  \n\n68.1) If your lock has a share link, post it in ⁠🔗┃shared-links ; else beg your keyholder to add 6 hours\n\n75) Banned from eating sugar for a day\n76) Throw out 3 pieces of male underwear, replace with newly-bought panties (bonus: matching bra's)\n77)  You’re not allowed to use words longer then 10 letters\n78) That game you really love? You're banned from playing it for 7 days.",
    "@Dee! May I take a lazy approach and inject 200+ tasks ? https://cypress-plier-68f.notion.site/ba7b4688b42c44f3840f504dc2be2ca6?v=27e7a59a2c86498e9b1128e568202f80   (edited)",
    "Oh dear, we're getting a little mixed up here  Lissa, it'd be great if you wanted to 'import' as many of your ideas as you wish. Don't worry about doing them in a single block or anything (unless you find that easier). They need to be in text, numbered each time, etc. I'll clean up anything which is text/discussion/messed-up etc when that's done",
    " yea i'll get the highlights out in here someday, or along the way of me writing them (edited)",
    "8) Listen to the song \"baby shark' on repeat for 30 minutes",
    " i know this one",
    "79) Give someone else a task in ⁠📝┃request-a-task\n80) Share 5 images in any of the media channels. For each one, write a sentence of what you like about it.\n81) Dye your hair, or get it cut, in a way you wouldn't normally.",
    "82) post 3 ideas in ⁠Community Task List",
    "83) shave only one leg but let the other grow out for a month\n84) Make a Dee-pun (don't forget to ping)\n85) No swearing allowed for the next week (edited)",
    "Indirectly workshopped ideas with @🦊SalsaQueen🔑 :\n86) Dress completely differently from normal for a day. Eg, if you normally wear dark, baggy clothes, try a nice colourful shirt!\n87) Carefully handwash your delicates (panties, bras, etc).",
    "88) spin your wheel of fortune. If you can't within the next hour roll again.",
    "89) fail your next verification picture. If you don't have that extension do two other task from this list at random.",
    "90) Clean your room, dressed as maid\n91) Re-watch your favorite movie, naked\n92) Not allowed to use the letter \"E\" for a day\n93) Pick someone active in this discord. Engage in conversation but purposefully mess up their honorifics. Take the punishment like a good girl\n94) Paint your nails in a bright color, keep for at least 2 days\n95) Instead of bodywriting, get creative with paper figures/letters and tanlines (edited)",
    "why did this thread come into existence? this be my living quarters now",
    "96) Add time to 20 locks in ⁠🔗┃shared-links.\n97) Wear the same socks for 3 days. Then, gag yourself with them for 10 minutes.\n98) Fill a bucket full of iced water. Pour it over your head, while fully-clothed.\n99) Confess a secret kinky fantasy in ⁠📋┃task-verification. Bonus points if it involves another server member.\n100) A big milestone deserves a big task! Get 6 random tasks from this list. Do any 5 of them. Good luck!",
    "101) submissive 101, spend 101 minutes collared today",
    "102) put on makeup (light or heavy), only use black lipstick on the upper lip and use an eyeliner to extend the corners of the lip with a swirl to create a mustache  . go out in public (you choose how likely someone will see you)",
    "102) put on makeup (light or heavy), only use black lipstick on the upper lip and use an eyeliner to extend the corners of the lip with a swirl to create a mustache  . go out in public (you choose how likely someone will see you)",
    "I like your thinkin",
    "I like your thinkin",
    "check task verification^^",
    "103) Practice making your own rope harness, keep it on for at least 4 hours\n104) Make your KH a drawing or write a poem for them (edited)",
    "105) Research the risks associated with ice/temperature play, then make a flesh light out of ice and use it until you edge, or it melts away.\n\n106) Use a music discovery service and find 10 songs you've not heard before that you like. Post them in ⁠🎵┃music \n\n107) Use a vibrator or otherwise make yourself come caged. Ruin the orgasm as well as you are able, you only need a drop. Describe the taste in ⁠📋┃task-verification \n\n108) If your BMI is over 18 immediately after your next fulfilling meal fast for 24 hours, make sure to drink plenty of water. If your BMI is 18 or lower, instead eat only healthy foods for 24 hours and consume at least approximately 2000 calories in this time.\n\n109) Go to the gym, do cardio for at least 40 minutes and lift weights for at least 20 minutes.\n\n110) Lucky spot, have an orgasm however you like. Describe the build-up and release in ⁠📋┃task-verification \n\n111) That thing you have been putting off, do it now.\n\n112) Spend 24 hours without any social media, including discord and other internet fora.\n\n113) If you don't have one already, purchase a gym membership.\n\n114) Take a walk, minimum 30 minutes. Don't use your phone, listen to music or otherwise distract yourself from your thoughts. Reflect on your relationship with your keyholder and write down your thoughts somewhere when you get home. \n\n115) Edge yourself caged until you manage to take a photo of a string of pre-cum, post it in ⁠📋┃task-verification \n\n116) Find an erotic hypnosis audio you think your keyholder would enjoy you listening to. Listen to it and give your keyholder a 300 word report on the file's content.\n\n117) Make something useful for your keyholder.\n\n118) Find a “cock hero” video that is at least 30 minutes long, stroke a dildo to the beat instead of yourself.\n\n119) Write a 300 word confession to your keyholder about something you feel embarrassed about, have been reluctant or afraid to share, or something you have told very few other people. Answer any follow-up questions honestly and straight, without dodging or joking away the questions. (edited)",
    "120) Roll a random task from this list and do it, describe or show proof to your keyholder and ask if they are satisfied with your execution. Repeat until they are.",
    "121) In real life, face to face, tell someone other than your keyholder that you're locked up in chastity. Can be mentioned off-hand or stated directly. It does not matter if they already know or not. (edited)",
    "122) Create an organized view of all of your kinky items, including but not limited to bondage rope, sex toys, and sexy outfits. Organize them in a fashion you're comfortable with, excel, Google Docs, website, blog, discord message or however you wish. For every item, include at minimum a picture you've taken of it, it's name, it's function, how experienced you are with it, and your feelings about it. (edited)",
    "123) If you have multiple cages you also might have multiple keys and locks. For every type of lock you have make sure you have exactly one lock and exactly two (working) keys. Dispose of the rest in a responsible fashion.",
    "124) Respond to 3 different topics in ⁠❔┃kink-questions \n125) Do 300 'peg-minutes'. 1 clothespeg/clamp, attached anywhere on your body for 1 minute, is 1 peg-minute. (So you can add more pegs to make it go faster!)",
    "96) Add time to 20 locks in ⁠🔗┃shared-links. 97) Wear the same socks for 3 days. Then, gag yourself with them for 10 minutes. 98) Fill a bucket full of iced water. Pour it over your head, while fully-clothed. 99) Confess a secret kinky fantasy in ⁠📋┃task-verification. Bonus points if it involves another server member. 100) A big milestone deserves a big task! Get 6 random tasks from this list. Do any 5 of them. Good luck!",
    "Reply to 96) => You're a monster  (edited)",
    "I'm a little late to the game, but these are what I have, for now. I'll definitely be adding more in the future~\n\n126) Play a game of go (https://online-go.com/learn-to-play-go to get started if you don't know how) and don't quit until you've one a round (if it's your first time, just complete the tutorial).\n\n127) In a kink setting, agree to any description/compliment you're given (without any implication of doubt or denial - the goal is enthusiastic agreement) for 72 hours. For instance, \"You're such a cute, dumb little [insert title here]\" or more general compliments such as being called cute (you know who you are).\n\n128) For the next week, you may only use toys after they've been in the freezer/soaked in ice for a few hours. Warming dildos up with oral/DT is not permitted.\n\n129) While on discord, don't speak unless directly asked a question - for the sake of simplicity, you can announce when you're on but otherwise you must rely solely on using either emotes or gifs for 48 hours.\n\n130) Be on a lewd content ban until Friday (NSFW-friday); if it's after Wednesday, do so until the next Friday (this used to be a loose-rule in another chat group).\n\n131) Add-on task: If you don't have a plushy/stuffed animal or don't have an edge/ruin task/ability, reroll. Whenever edging/ruining over the course of 3 days, do so over/on to a plushie. \n\n132) Sleep in 'light' (reads: little to no risk) restraints at the foot of your bed for a 5 days.\n\n133) Try a food that is rumored to smell foul but taste good (ex, durian, luosifen)\n\n134) Stay outside of your dwelling for as long as possible for one day -- if you have a yard/porch, use it only when it gets dark out (because safety). Hopping over to a friend or relative's house is not allowed. Only come in for breaks (grabbing food, washing up/changing if the weather is ill-fitting) and for sleeping. Verify in task-verification by posting shots of things around you every hour (without giving away the location, obviously).\n\n135) Write a 450 word informal biography on an artist you've been listening to/following recently - include a short blurb after about why they are particularly interesting to you and post it in task-verification.\n\n136) Practice and learn the choreography to Taemin's (태민) song 'Move' over the course of 1-2 weeks.  ",
    "137) go to bed with enough time to get a good 8 hrs of sleep (edited)",
    "138) Find another submissive who has permission and is willing to wager a task they are assigned. Agree on a way to resolve the bet, e.g. chess, go, tick-tack-toe, rock-paper-scissors or a coin flip. Loser gets the wagered task and has to roll one more random task from this list. (edited)",
    "139) If you don't already know, read up on the melting point of various types of candle vax and their suitability for kinky play. Then attempt to write your keyholders name on your body with melted wax, creative thinking to achieve a good result is encouraged. Share in ⁠📋┃task-verification (edited)",
    "140) Find out how many clothes pegs you can fit on your genitals. Share the count and a picture in ⁠📋┃task-verification",
    "141) Do 100 push-ups in a 24 hour period, they don't have to be consecutive. Make sure you have good form, straight back.",
    "142) Drink a tall glass of water.",
    "143) Ask a keyholder or switch you like when their birthday is. Set a reminder to get them a gift for it. It can be from a wishlist, offering them control of a short lock, or something nice you make for them.",
    "144) Eat as you normally would, but add hot sauce to anything that isn't a traditional drink for a day (ex, water, tea, wine, etc.)",
    "145) Using body paint, make a picture using your breasts/balls as a brush and hang it up somewhere with no context.",
    "146) Ask ⁠⭐┃general to give you a new nickname. Pick one of the first 3 replies, and use it for 48h.\n147) Search for 'temporary tattoos' on your preferred online marketplace. Order and apply the most degrading one. Keep it for at least 72h.\n148) Write a thank you note to your keyholder for keeping you locked up, and explain why you don't deserve to have access to your bits. Keep it in your purse/wallet for the rest of your lock.",
    "149) Buy some white cotton panties and carefully embroider \"slut\" (or other term supplied by your keyholder) on them, front and back. Wear when finished.",
    "150) make your keyholder trusted. If they're alreay trusted  roll again. If it's a limit for you, roll twice again instead.",
    "151) roll again an perform that task in a public place, (if possible/legal/allowed)",
    "152) Convince another person in chat to swap names with you for 24h",
    "153) Don't walk on the main part of your foot for 24h. Toes and the balls of your feet only.",
    "154) The next time you get really embarrassed, go to a paint-mixing company (such as https://www.dulux.co.uk/en/colour-details/filters/h_Red#tabId=item1) and pick out the colour that best matches your cheeks. Share it in chat",
    "155) Ask your keyholder to give you a humiliating sentence to write 85 times, use a camera and record the paper as you complete it over voice chat on live.",
    "All first 155 tasks with no chatter so things are a bit easier readable\nAt 200 I'll also run a de-dup",
    "156) Roll a D6: this will be the max amount of clothing you're allowed to wear today (shoes don't count, don't forget to put on a bit more once going into public)",
    "Dee! pinned a message to this channel. See all pinned messages. — 02/24/2023 4:09 PM",
    "157) Censor 5 porn pics you really like and post them in the appropriate media channels. Tell everyone what you like about them, and why you don't deserve to see them.\n158) Research and install one subby/embarrassing program or app on your computer or phone (eg WallClaimer, Qustodio, BetaSafety, Edgeware, etc). Play around with it to get a feel for how it works. Tell your KH you have it installed, and leave it installed until your lock ends.\n159) Ask your keyholder or general chat for a sentence. Record yourself saying that sentence 10 times. Post in ⁠📋┃task-verification\n160) For the next 72h, you can only watch/listen to/play media that would be rated as safe for young children (usually a 'G' or 'U' rating). You can have some scarier stuff (usually a 'PG' or '12A' rating) if your keyholder grants permission. Nothing above that, though!\n161) Pick out a really scary horror movie. Watch it by yourself, in the dark, with no interruptions or distractions.",
    "162) You must drink all liquids out of a sippy cup for 24hrs",
    "163) You must shave your entire body \nOr an alternative:\n164) You must ask your KH exactly what hair they like where on your body and shave your body according to their preferences.",
    "165) Create a playlist of five up-tempo songs you can dance to. Perform the Carlton Banks dance confidently with a big smile as you play them loudly. Best if done on camera for your KH.  \n166) Tie/Cuff hands (behind back) and feet and kneel on uncooked rice for fifteen minutes.\n167) Do a lap around your house naked. Can be done at night, of course.\n168) Hold a coin to the wall with your nose... but do this outside.\n169) Nipple clamps for 15 minutes, but have lotion or lube on your fingers and give your nipples a firm rub for a constant three minutes once the clamps come off.\n170) Use only chopsticks to eat for the next 24 hours. Cannot be Asian food! Hands are not allowed to touch food.\n171) Cornertime for 20 minutes while barefoot and standing on legos/jacks/gravel or something else uncomfortable of that sort.\n172) Create a clothespin zipper line with at least 10 clothespins. Attach to various sensitive areas of your body (nipples, ball-sack, inner thighs, etc.). Leave on for at least 15 minutes and then yank them off all at once.\n173) Throw a handful of uncooked rice on the floor and count them as you pick them up one by one.\n174) Buy three of the largest bags of M&Ms (or Skittles if preferred) you can find. Organize and count the contents of each by color.\n175) Spend 30 minutes in a closet with the door closed. No devices allowed (set a timer on the phone and place it just outside the door). Your attire (naked, uniform, cuffed, gagged, etc.) is up to your KH.",
    "176) Watch a porn video of 30 minutes in length that you like and write down and DM me(Bris#5253) the link and at least 3 questions and answers from something featured in the video (edited)",
    "177) insult your keyholder, beg for mercy after and deal with the consequences.",
    "178) Ask your keyholder for a line to write 50 times. It must be both grammatically incorrect and spelled poorly. (edited)",
    "179) Host a ⁠⏰┃community-events. (Feel free to ask for help if you need it!)\n180) Go to the shops and buy exactly 5 items- one worth £1, £2, £3, £4, and £5. Use your local currency, and you're allowed to go 10p either side. All the items must be things you'd enjoy. Then, use them all in one day.\n181) Install an alternative browser, music player, word processor, or other commonly-used utility. For the next 7 days, you must use that one instead of what you'd normally use.\n182) Keep a dream diary for the next week. You must make your entries as soon as you wake up for any sleep, and even if you don't remember anything.\n183) Memorise pi to 50 digits. Film yourself, blindfolded, reciting it.",
    "184) Give your KH a rare, valuable, difficult-to-obtain, or specifically-useful-to-them item in a video game you both play.\n185) Put a verification picture from a previous task up on your bedroom wall for 72h.\n186) Read a book written before 1900.\n187) Watch a movie with a rotten tomatoes rating score of 20% or less.\n188) Completely shave your genitals.\n189) Drink an alcoholic beverage you haven't tried before.\n190) For the next week, put your pillows at the other end of your bed, and sleep \"upside down\" to your usual orientation",
    "191) Hold the Special Calming Position for 20 minutes: ⁠⭐┃general⁠",
    "192) Wear a lovense or other vibrating plug that can be controlled remotely. Get someone to take control then walk to a store(no driving) and purchase a item from the store.",
    "193) Take an explicit photo of yourself nude somewhere outside. For example your backyard or the woods, your choice. You may censor face or other identifying marks. Post in ⁠📋┃task-verification (edited)",
    "194) If you need to unlock for this task ask your keyholder for permission first. In a 24h period spend 1 hour total time playing with yourself, but no edges are allowed. You must stop the time if you get close to an edge, or if you take a break from actively stimulating yourself for any reason. Use a stopwatch to keep the time. You must be doing something that feels good enough that you could orgasm from it, for example use a vibrator on your cage or rub that sensitive spot like a girl.",
    "195) Do some reconnaissance(HUMINT or OSINT) to find out something your keyholder likes and desires that you did not already know of, you may not ask your keyholder directly though. Take some action to fulfill this desire. (edited)",
    "196) Complete a classic 'LucasArts' adventure game from start to finish (such as 'The Dig'). You may not look up any hints or walkthroughs without your keyholder's permission.",
    "197) Post a picture of your desk, as-is in ⁠📋┃task-verification. Spend at least 30 minutes cleaning and tidying it, then post again to show the improvement.",
    "198) Select your most pungent/strong spice/seasoning mix. Bring it close to your nose and inhale deeply.",
    "199) Cut out or sew up all the pockets in their clothing",
    "200)  If you get lines to write, translate it into another language (or a language you're learning) and submit it in ⁠📋┃task-verification .",
    "201) hit guess on guess the timer twice. If you don't have that extension roll again.",
    "202) Order them to buy custom panties, in Dom/mes colour of choice\n203) Order them to squat in said panties, counting each squat as they go\n204) Or order them to squat and then hold the squat for a count of 5 whilst still counting the reps (if they lose count, start again)\n204) Another alternative is have them squat above a dildo, even at the lowest point of the squat their hole only brushes against the tip\n205) Can also add plugs, nipple clamps, gags, ice cubes in each hand etc.",
    "206) Do some 'body art', with your cage/belt the centrepiece. Ideally you should 'dress it up' to look like something else. Post in ⁠📋┃task-verification when you're done.",
    "207) Sing the alphabet backwards. Every time you mess up, spank your ass 10 times",
    "208) Make a “snow angel”. If there’s no snow, it’s up to you to find a replacement medium. Perhaps sand, mud, or beans! Post the picture in #task-verification.\n209) Sleep on the floor tonight. You can have at most one large (eg duvet, sleeping bag) OR two small (eg blanket, pillow) soft items to help.\n210) Order the spiciest thing on the menu from your usual fast food takeaway. Eat all of it.\n211) Open https://en.wikipedia.org/wiki/Special:Random 3 times in different tabs. Pick 1 of them. Then, note the title, close the page, and prepare a 10 minute presentation on that topic. You should perform your own research, but may not look at the original Wikipedia page. Present it to your keyholder.\n212) For 5 hours, every 30m, move your lockbox (or similar) to a different place in your house. You must be able to describe each location differently. When you do, say out loud “My lockbox is in [location]” three times, and note the location on paper. 30m after you do this for the 10th and final time, roll a D10. Move your lockbox to the corresponding location on your paper. Say nothing out loud. Burn or shred the paper. Finally, you may not look at or touch your lockbox for 24h. (edited)",
    "213) Fuck the contents of a can of SpaghettiOs or a can of Chef Boyardee Ravioli (or the best equivalent of cheap canned pasta you can get in your country) for 5 minutes.",
    "214) Attempt to fuck a tomato (or smash a tomato against your belt/cage).\n215) Write fanfic about you and you KH, min 300 words.\n216) Write at least 200 words on why cumming is only for the best toys.",
    "217) Write out the last 50 messages posted in ⁠⭐┃general",
    "218) go to  https://en.wikipedia.org/wiki/Sex_position   copy over the paragraph  \"Penetrating partner on top with front entry\" (handwritten copy) (edited)",
    "219) find a kinky story (kh's choice, random, latests on a site like literotica)  copy over text till you've handwritten at least one A4 of text.",
    "220) Pick a number, \"X\", between 1 and 10. For the next X days, you can't have more than X browser tabs open at the same time",
    "221) Eat a meal which is meant to be eaten with utensils, without utensils\n222) Eat a meal out of a dog bowl, on the ground, without using your hands\n223) Put a clothespeg on your tongue for 20m\n224) Tie a rope harness on yourself for 3h\n225) Do a double shot of alcoholic spirits",
    "226) Make an ahegao face.",
    "227) write a handwritten review  (200 words minimum) of your next task and place it in ⁠📋┃task-verificationRoll again to get the next task",
    "228) Name something you like, then write 200 words about why that thing sucks",
    "229) Infodump about something you really enjoy",
    "228) Name something you like, then write 200 words about why that thing sucks",
    "But I like Miss Ana and She doesn't suck ",
    "230) Keep a diary for 7 consecutive days, be honest and include as much as possible without violating your privacy. E.g. feelings about you lock, your desires and your activities. Share it with your keyholder.",
    "231) Spend 20 minutes outside, gagged, underneath a mask\n232) Put your feet in ice water for 3 minutes\n233) Order some adult diapers. Post a picture of the order confirmation to ⁠📋┃task-verification\n234) For 24h, don't drink any caffeinated beverages (including tea, coffee, and coke)\n235) For 24h, don't eat any snacks\n236) For 24h, don't drink any alcohol\n237) For 24h, don't use any 4+ syllable words (spoken or typed). You are allowed at most 3 mistakes\n238) For 24h, attach a bell to your cage/belt\n239) For 24h, send at least one message in ⁠⭐┃general every hour (edited)",
    "8) Listen to the song \"baby shark' on repeat for 30 minutes",
    "Wow! That is evil!",
    "240) For 24h, don't swear.\n241) Write a paragraph about why you're a strong competent individual who's able to make their own decisions... by holding the biggest crayon you can find in the fist of your off-hand. Post the picture to ⁠📋┃task-verification.\n242) Post 5 pictures of your (animal) pet to the server.\n243) Strip naked and get on your hands and knees. Crawl into every room in your flat/house/property, and spin once in it. Return to where you started before standing up.",
    "244) Watch an episode of \"Milf Manor\", and write a short review",
    "245) Write 200 words about why this is the best pigeon picture you have ever seen.",
    "245) Write 200 words about why this is the best pigeon picture you have ever seen.",
    "Sorry this one I took last weekend is better, little guys risking their lives on the track ",
    "245) Write 200 words about why this is the best pigeon picture you have ever seen.",
    "i propose an alternative image",
    "245) Write 200 words about why this is the best pigeon picture you have ever seen.",
    "For who loves pigeon",
    "246) Buy these temporary tattoos and apply one. Show it off proudly in your verification pictures. https://www.amazon.com/Temporary-Tattoos-Abdomen-Waterproof-Stickers/dp/B0969MHYKR/ref=mp_s_a_1_4?keywords=womb+tattoo&qid=1679240538&sr=8-4 and/or https://www.amazon.com/kink-ink-Hardcore-Phrases-Temporary/dp/B097QYC1Q3/ref=mp_s_a_1_14?keywords=womb+tattoo&qid=1679240538&sr=8-14. BTW they last about 2 weeks so this can be a non-trivial task! When it wears off, do another one. (edited)",
    "247) When you do a hygiene opening, lock your key someplace risky where a housemate might see it. Savor the fear of possible discovery. Do not plan words to say if you are indeed discovered; let yourself blush deeply and stumble for words and excuses. Savor the fear of humiliation too.\nWho needs horror movies, anyway? (edited)",
    "248) Sort your socks by color. Then again by material.  Then again by length. Then pair them with matching underwear.  Then sort them again.",
    "249) Bleach a strand of hair",
    "250) Watch the first movie you find that someone recommended in ⁠🎵┃music or ⁠📁┃misc-media - even if you don't think you will like the movie - and especially if you think you will hate it!   You might learn something.",
    "251) Ask ChatGPT for a task. \n252) Ask ChatGPT how much time you should add to your sentence.  (you may need to be creative to dodge the NSFW-filtering of chatGPT)\n253) Ask ChatGPT how much other tasks from this list you should do. (you may need to be creative to dodge the NSFW-filtering of chatGPT)",
    "But I like Miss Ana and She doesn't suck ",
    "Ultimate uno reverse card",
    "254) Freeze your lock until you get to the top of the mountain in Getting Over It",
    "254) Freeze your lock until you get to the top of the mountain in Getting Over It",
    "Best task so far (edited)",
    "Best task so far (edited)",
    "I'm honoured lol",
    "255) generate a number between 1 and the number of tasks in this channel. Do that task",
    "256) Order a pizza with your NSFW email and whatever name is attached to it.",
    "I hate to break such a nice number but here goes:\n\n257) Write down something you really don't want to have others, including your keyholder, to know about you. Your deepest darkest sexy secret. Write it down in this website https://pastebin.com/ \n\nUse settings Paste Expiration one month or longer, and enable password protection. Set a password you will remember and create the paste then send paste link to your keyholder for safe keeping. It would be a shame if they got the password somehow ",
    "258) You may not edit discord messages to fix typos/grammar/spelling for the next 24 hours",
    "259) You may not delete discord messages for the next 24 hours",
    "260) Start a stereotypically difficult videogame (eg Dark Souls, Arma, some survival sandbox games) that you have little to no experience with. Play until you beat the first major milestone (e.g. first non-tutorial boss, first mission, etc)",
    "I feel like this could be used for a pretty fun task\nhttps://www.planetminecraft.com/data-pack/ai-hunter-minecraft-manhunt-but-you-have-no-friend-speedrunner-vs-terminator/",
    "261) Talk in 3rd person for 24h",
    "All tasks so far, did not dedup",
    "@Dee! can you re-pin things? ",
    "Dee! pinned a message to this channel. See all pinned messages. — 03/22/2023 4:43 PM",
    "Dee! pinned a message to this channel. See all pinned messages. — 03/22/2023 4:44 PM",
    "262) Sub can offer services etc in exchange for time out of frilly panties\n262 a)  For example, sub can earn 1 day in boy panties by being caged for 1 week",
    "258) You may not edit discord messages to fix typos/grammar/spelling for the next 24 hours",
    "Hard limit",
    "263) You may not point out typos/grammar/spelling in others Discord messages for the next 24 hours.",
    "Dee! changed the post title: Community Task List — 03/23/2023 12:54 PM",
    "264) Your next 3 showers are with cold water",
    "265) Your next 2 showers are with clothes still on",
    "266) Learn to sing a song and record your best attempt at performing it and post it in ⁠📋┃task-verification",
    "267) Paint your face in some unusual way and leave it for at least 4 hours (it could be actual facepaint, lipstick on your cheeks, biro, anything skin safe)",
    "268) If you're currently doing any kind of punishment/penalty. Restart it. If not, roll again.",
    "So like, repeat the last punishment?",
    "So like, repeat the last punishment?",
    "Yeah, literally anything though so it might be easy or really hard. Wrote 90/100 lines, too bad. One your last day of a week long rule? Too bad",
    "Nice",
    "269) bad luck : roll 5 more task on this list.",
    "270) write out all the current tasks in this channel",
    "271) Write a list of 100 reasons you're a good person",
    "270) write out all the current tasks in this channel",
    "on paper? (edited)",
    "on paper? (edited)",
    "I'd say up to task giver to decide",
    "272) Banned from using emotes or emojis for 48 hours.",
    "273) Type \"haha\" after every single sentence you write in this server, for 7 days. (edited)",
    "272) Banned from using emotes or emojis for 48 hours.",
    "I feel betrayed  ",
    "I feel betrayed  ",
    "Just be careful not to roll a 272! ",
    "274) At the next opportunity get out of bed and go to your bathroom. Say to the mirror \"I am a handsome tiger\".",
    "275) Do a photo shoot where you start in normal clothes, but each picture is increasingly sluttier than the last, until in the last picture you're a complete slut",
    "276) At some point, interrupt a random conversation on Chaster with the following sentences in separate messages but immediate succession (the more random this is the better):\n\nFor the record I've been penetrated many many times before\nWanted to make that clear\nLike more times than I can count (edited)",
    "oh no we got silenced",
    "260) Start a stereotypically difficult videogame (eg Dark Souls, Arma, some survival sandbox games) that you have little to no experience with. Play until you beat the first major milestone (e.g. first non-tutorial boss, first mission, etc)",
    "Arma tutorials are notoriously broken so that's rough ",
    "277) Finish every sentence with the word \"pussy\" for 2 days",
    "277) Finish every sentence with the word \"pussy\" for 2 days",
    "Aggressive pussy or horny pussy",
    "Aggressive pussy or horny pussy",
    "Neutral",
    "278) Ask for a Gartic Phone topic during games night and use one of the results as a PFP for 72 hours.\n279) Write a paragraph (5-8 sentences) on how you can be an (even) better sub/switch. Post it in task-verifications using a bunch of 'bottom emojis' to sweetened it up.\n280) Come up with a list of ten things that need to be improved in order for you to be (more) fulfilled in the long-term and post it in task verifications. (edited)",
    "281) Tell @Dee! hes a rat like the fucking rat he is (edited)",
    "Those are some good ones. ",
    "thank you summer",
    "i know",
    "@Chef Emma (stealth sub) @Headmistress Ana Dyne 🔑 new task what do you both think",
    "Check the second pinned bulletpoint of the post, biatch ",
    "i just dont care  /j",
    "make an exception for the carrot and ell headpats at least",
    "like cmon those are important ",
    "make an exception for the carrot and ell headpats at least",
    "It does make it difficult for people to actually roll them, though. Plus if everyone adds their subs, it's a useless mess ",
    "Calling me a rat is fine though I guess  ",
    "so no carrot or ell headpats, but calling you a rat is fine",
    "got it",
    "so no carrot or ell headpats, but calling you a rat is fine",
    "            ",
    "Dee is a meanie",
    "   ",
    "282) Say 5 nice things about your keyholder, and ask them to do the same for you",
    "283) for the next 24h, all your discord message should contain at least one Dee puns (ex: Deelicious)",
    "284) Tie/Cuff hands (behind back) and feet and kneel on lego pieces for fifteen minutes.",
    "285) Load the last porn video you watched that was at least 5 minutes long. Write a detailed transcript of it, including not just spoken dialogue and scene changes, but also broad \"stage directions\" and all vocalisations made by any performers. Post in ⁠📋┃task-verification",
    "285) Load the last porn video you watched that was at least 5 minutes long. Write a detailed transcript of it, including not just spoken dialogue and scene changes, but also broad \"stage directions\" and all vocalisations made by any performers. Post in ⁠📋┃task-verification",
    "\"Uhhh, uhhh, uhhhh, harder, harder, harder\" grunts and groans",
    "\"Uhhh, uhhh, uhhhh, harder, harder, harder\" grunts and groans",
    "I was suddenly inspired ",
    "286) Find a still image from a porn video that you really like. Photoshop yourself (can be your Chaster profile image) into it.",
    "287) Record an MP3 (or similar audio file) of any noises you make during an edge/ruin and post it in task verification with a short description of the task (so people aren't caught unawares).",
    "Dumpling said she was gonna change this in case she gets the task herself",
    "Dumpling said she was gonna change this in case she gets the task herself",
    "  April fools' is a flawed day (edited)",
    "  April fools' is a flawed day (edited)",
    "Yeah i literally know, you saw wat i treid earlier",
    "Yeah i literally know, you saw wat i treid earlier",
    " THAT WAS ANA'S DECISION THOUGH",
    "Fffffffffffffffffffffffffffffffffffffffffffffffff",
    "288) Write a review of porn video you really like. Assess the strengths and weaknesses in detail, and give it a score at the end. 1 page minimum. Post in ⁠📋┃task-verification\n289) Get two lines from your keyholder with the same number of words. Go on voice chat, and handwrite one 30 times, while saying the other out loud at the same time. If you make a mistake, start over.",
    "290) Read an erotic story of your/your keyholder's choice and write a review on it. Go into detail and give it a score at the end. 1 page minimum. Post in ⁠📋┃task-verification \n(just combining Dee's idea in 288 with @❤Nami's beta girl❤ reviews from yesterday)",
    "291) Find out how many spanks you can give yourself before you physically can't take any anymore (either because the pain is too much or it's making you edge). If applicable, report this number to your keyholder.",
    "292) For the next 24 hours (0.071 fortnights): \n- Only use fortnights as a unit when referring to time\n- Only use Kelvin when referring to temperature\n- Only use Newtons when referring to mass (assuming Earth gravity)\n- Only use furlongs when referring to length\n- Only use cubic inches when referring to volume (edited)",
    "292) For the next 24 hours (0.071 fortnights):  - Only use fortnights as a unit when referring to time - Only use Kelvin when referring to temperature - Only use Newtons when referring to mass (assuming Earth gravity) - Only use furlongs when referring to length - Only use cubic inches when referring to volume (edited)",
    "Can I introduce you to the wonders of not talking?",
    "293) do the next task 5 times,  roll again.",
    "293) do the next task 5 times,  roll again.",
    "This could be dangerous!",
    "This could be dangerous!",
    "just don't roll it ",
    "With my luck I will get it multiple times in a row and it will multiply!",
    "294) Do all the 292 first task Be \"healthy\" for the next 2 days : at least 2 \"real\" meal in the day (not junk food :p), only drinking water, try to do some form of exercise if possible (like 30mn walk), go to bed at a decent hour, sleep at least the number of hour you need for a good sleep (generally it's 7-8) etc...",
    "291) Find out how many spanks you can give yourself before you physically can't take any anymore (either because the pain is too much or it's making you edge). If applicable, report this number to your keyholder.",
    "\"I approve of this message\" ",
    "292) For the next 24 hours (0.071 fortnights):  - Only use fortnights as a unit when referring to time - Only use Kelvin when referring to temperature - Only use Newtons when referring to mass (assuming Earth gravity) - Only use furlongs when referring to length - Only use cubic inches when referring to volume (edited)",
    " <cries in scientist>",
    "I am new to chaster. And starting my first lock tomorrow!!!\nDo the task need to be verified by photo/video? Or how am I held accountable",
    "295) Pair up all your socks and put them away neatly",
    "I am new to chaster. And starting my first lock tomorrow!!! Do the task need to be verified by photo/video? Or how am I held accountable",
    "⁠👋┃getting-started",
    "296) [if locked] -> write your keyholder a letter, 1 page long about anything relating to them {can be things like the kh themselves, a topic they like, etc}\n          [If unlocked] -> write whoever you consider yourself closest to on the server a similar letter (edited)",
    "@Dee! giving you this asap",
    "297) Roll a D6, and do the corresponding math problem:\n\nProblem 1:\n3x - 4 = 2x\nProblem 2:\nx + 2 = 2x - 1\nProblem 3:\n2x - 3 = x + 2\nProblem 4:\n(3x - 6)/x = 2\nProblem 5:\n-(2x - 2) = (x-4)\nProblem 6:\n(4x - 4) / (x + 2) = 8 / 3\n\nThen roll a D20, multiply it by the “x” you solved for, and do that number’s task. \n(Every “x” is a whole number to make it easier, don’t cheat  )",
    "298) discover how many calories are in all the food you eat for the next three days. You may need to weight the food before you eat it or check the box.",
    "299) post a video of you complementing your pensis and telling it how much you love and appreciate it. (edited)",
    "300) post a video of yourself singing \"I'm a little tea pot\" with all the motions. You may hide your face and any identification marks e.g. tattoos.",
    "301) watch at least 20 minutes of your favourite porn. Sit on your hands and do not touch.",
    "302) Write a dating profile (and post to verification channel) describing at least 5 things you love about yourself.",
    "303) Rub a generous amount of chilli paste into your hands. Watch at least 20 minutes of your favourite porn... What you do with your hands is up to you ",
    "304) have a cold bath/ shower for at least 10 mins. Take before and after photos of your penis and post so we can see the difference.",
    "305) Don't wear any underwear for the next three days.",
    "306) Try something new. It can be trying a new food, a place to eat, a new book, a different drink order, going to a new place. Anything that you haven't done before.",
    "307) wear a suit or smartest outfit and go for a coffee somewhere. Send pictures of your outfit.",
    "307) wear a suit or smartest outfit and go for a coffee somewhere. Send pictures of your outfit.",
    "On a personal note. I personally find men in suits hot ",
    "308) research some gorean slave poses. Post pictures of yourself doing at least three of them, and name the pose.",
    "309) for the next three days, post a picture of everything you eat to the Nom channel.",
    "310) for the next week, each day write at least 5 things you are grateful for.",
    "311) On your body, write at least three things you are grateful for.",
    "312) make something creative such as a story, painting, photography, art, digital art, poem, music, anything and post it to the server in the relevant channel.",
    "313) chain or tie yourself to your bed for at least 30 minutes. You are not allowed to use your phone or any other electronic devices in that time.",
    "313) find a video on cock or ball bondage, try to follow the video. Post a picture of your results.",
    "314) record yourself peeing on your own feet (in the shower or bath) and post the video",
    "315) stretch an elastic band against your thigh and ping it against your leg at least 10 times. (Warning, may bruise)",
    "316) for the next week, journal each day. At least one A5 page or half an A4 page. Just whatever comes to mind and write it down.",
    "317) for the next week, do yoga for at least 20 minutes per day. You can find plenty of videos to follow online.",
    "@Oceana These are great! Thanks for the ideas! ",
    "@Oceana These are great! Thanks for the ideas! ",
    "Very welcome. If I think of more I'll add them. I had a bank of them for my own amusement ",
    "318) for the next 3 days, you must use all honorifics Keyholders use if it's in their name when talking to them",
    "319) For the next 5 days, you can no longer use gifs, emotes or reactions",
    "320) for the next 7 days, you become Yoda. Speak normally can't you no more (edited)",
    "321) For the next 24 hours, you must remove all vowels from the words you use.\n322) For the next week, you must repeat whatever you are responding to in your response before you can respond.\n323) For the next week, instead of using words like he, she, they, you, we, I, etc... You must always use the name of the person or people in question.",
    "324) For the next week, your discord has to be in Light mode",
    "325) For the next 3 days, You are banned from using any electronic device other then your phone",
    "326) For the next 3, You have to change your username on this server to \"Poopypants\" (edited)",
    "327) For the next 2 days, You can't wear socks of any kind",
    "328) For the next 24 hours, You must ask your KH if you can go to the toilet in the most begging way you can in public chat",
    "329) for the next 3 days, Space bar no longer exists on any device you can access Discord on. youliterallyhavetotypelikethis (edited)",
    "330)For the next week, you must wear socks and shoes to bed (edited)",
    "331) For the next 24 hours, You must compliment Dee as much as possible",
    "332) For the next 7 days, You must sleep with your head where you feet normally are and your feet where your head normally is.. so rotate 180 degrees. and no, you cannot take your pillow with you, Guess your feet will get cozy on that Pillow",
    "333) Triple digits ey. for the next 3 days, You must add \"This message was provided to you by <discordusername>\" on any message you send",
    "334) For the next 3 days, you must sleep under your bed if possible. If it is not possible, you must sleep on the floor",
    "335) For the next 7 days, You must send me goodnight wishes when you go to bed. tag me in the message",
    "336) For the next 2 weeks, you must say \"Im just a lil guy\" after every message (edited)",
    "337) for the entire month (or what is remaining of the month), your first message when entering chat must be the weather report of that day.",
    "338)For the next 30 days, you must always announce yourself with \"<discordusername> IS HERE\" as your first message (edited)",
    "339) for the next 10 days, you must watch the hit tv show \"between the lions\" and after the ten days you must give a summary of the show and give specific details from certain episodes. (edited)",
    "340) for the next 24 hours, you must listen to \"lift yourself\" by Kanye West and only that song whenever you play music. You must listen to it at least 20 times and must keep track of each time by telling your kh when you did. (edited)",
    "341) For the next week, you must wear all of your clothes inside out.",
    "342）Censor one of your favorite lewd pictures of yourself on all devices/sites and send your KH the original.",
    "343) Take a cold shower, complete one edge whilst in it (water doesn't have to be the coldest it will go, just colder than you're comfortable with)",
    "344) There is no task. You don't have to re-roll, you don't have to ask for a task. There's nothing.",
    "345) you have to re-roll 5 more tasks. that's the task. and yes, you got to do them all.",
    "346) (internet capable toy specific task) Over the next 3 weeks, you must research and create a 10 minute presentation on your fav subject. If you have a lovense toy, it must be presented while the viewers play with it.",
    "347) For the next week, the only porn you can view is anything created by Chaster server members during a game of GarticPhone",
    "348) Send the following message to 5 people in your contacts (Swap $ for relevant currency symbol): \"Hey, sorry for the short notice, but I need to borrow $300\"",
    "349) Make a small donation to a charity.",
    "350) Put Lego bricks or small stones in your socks before putting on your shoes, Walk on that for 8 hours.",
    "351) Choose a task from something you don't like, make a task out of it. Example CBT = 25 Spanks to balls.",
    "352) You must stand for next 6 hours. You may walk and pace, but no sitting until the 6 hours are over.",
    "353) Put a suction cup dildo on a wall in a corner, now begin sucking, you'll spend the next 3 hours this way",
    "354) Eat a cup of dog food from a dog bowl on the floor. < Do at your own risk heard this has risks >",
    "355) Whenever you have free time you will continue to write the following until it's been done 2500 Times. Extra Credit If you do 5000 or 10,000 Times.\n\" I love my Chastity and I should wear it always.\" (edited)",
    "356) Sleep naked for one night! If you already happen to sleep naked, sleep without a blanket. (edited)",
    "357) Spend 3 Hours with nose against wall holding a coin, keep track each time coin drops. That equals 25 Spanks per butt check.",
    "358 ) Plug task:\n1. if you own a lovense toy, next time you shower, you will put it in and share the control link in the server\n2. if you can't do 1, use your biggest plug and wear it for 24 hours the next day\n3. if you can't do that, but own a Tail plug, wear it for most of the day and sleep with it",
    "359) Go for a walk in the woods and wet yourself, when you get home put wet panties in mouth and cage edge for 20 minz",
    "360) Play along and post in every ⁠🎲┃minigames\n361) Summarise the \"story\" so far in ⁠Three Word Story",
    "362) Go on camera in the VC and spank self 500 times, make an announcement 3 hours before starting for people to watch.",
    "363) For the next 3 days speak only in 3rd person and use it/it's pronouns when talking about self.\nExample \"Giggles is a Good Slave, It did all its tasks today\"",
    "364) (Task for Trans and Sissies) This task can take a max of 6 weeks, roll a D6, for example so you get a 4. Then once a week for 4 weeks as Dx equals one week per number on dice, you must buy a female outfit and donate a buys outfit in it place, the point of this task is to slowly add more girls clothing than boys to your closet. When task is done flip a coin, heads play one more time, tails you can quit.\nWarning you may run out of boys clothing and can't buy new ones until this task is done. (edited)",
    "324) For the next week, your discord has to be in Light mode",
    "This is evil!",
    "365) Summarise pornhub's terms of service in ⁠📋┃task-verification \n\n(inspired by Bo Burnham)",
    "366) (lovens plug task) wear your plug and share the link in the server, only able to take it out after you bake a loaf of bread from scratch (including waiting for dough to rise) (edited)",
    "365) Summarise pornhub's terms of service in ⁠📋┃task-verification   (inspired by Bo Burnham)",
    "367) Go for a drive and obey all the traffic laws in Grand Theft Auto Five. Add a day for every law broken\n\n(Also inspired by Bo Burnham) (edited)",
    "367) Go for a drive and obey all the traffic laws in Grand Theft Auto Five. Add a day for every law broken  (Also inspired by Bo Burnham) (edited)",
    "This just gave me a funny feeling",
    "368) You must wear a hat every day for a week, except for instances where you would normally wear a hat.",
    "369) Go for a walk playing Pokémon Go with chastity a hush in, you have to spin 30 Pokémon Stops and catch 100 Pokémon before battery dies or add 10 days to your lock.",
    "370 ) Go out of your house for a walk, you have to gather at least 3 different leaf. If not possible because winter or I don't know, just walk for at least 20mn.",
    "371) Change the language on your PC to a language you do not understand for 24 hours.",
    "371) Change the language on your PC to a language you do not understand for 24 hours.",
    "Changing it back after 24 hours might be a challenge ",
    "Changing it back after 24 hours might be a challenge ",
    "Just set up a bot to do it automatically after 24 hours",
    "372) spend 30 minutes edging with the wand on your cage no cuming",
    "373) Flip a coin if heads double your time or add 15 days < Whichever is less > if tails you are allowed something sweet for desert tonight.",
    "374) Change your discord name to \"Miss Krissy The Kitty Fox\" for 24 hours",
    "374) Change your discord name to \"Miss Krissy The Kitty Fox\" for 24 hours",
    "Pinnable",
    "375) Publicly convince @Ell 🔒Goddess Artemis to listen to a Nickelback song",
    "376) Complete the most recently added task (edited)",
    "377) Suggest a new task and complete it",
    "378) 0/20 Points, every day for 30 days roll a dice, if you get a 2 or 5 add a point, if you get 20 points in 30 days, perma lock, more fun if you play each month your locked.",
    "379) record yourself saying \"a little bottle of water' in your most british accent and add it to ⁠📋┃task-verification  or ⁠Soundboard Suggestions!"
]